[{"page_num": 0, "text": " \n Mohammed Asadullah Shareef,  CEng MCIBSE   Mobile: 0044 -7701097800 \n133 Harborough Road  Email:  asad.shareef@yahoo.co.uk  \nLeicester, LE2  4LG Skype id:  asad.shareef  \n \nPROFESSIONAL PROFILE  \n \n \n Chartered Engineer with 15 years’ experience as Electrical Engineer with expertise in designing and checking \nelectrical installations in a building to International Standards.  \n I have worked as Lead Engineer, Project Manager / Engineer and Design Enginee r on various projects.  \n Site experience – work closely with the design team, examine materials used, check workmanship, produce site \nprogress reports, check defects and organise testing / commissioning. Produce risk registers and HAZID reports.  \n Expe rience working on both new build and refurbishment projects. I am a team member and an individual \nengineer responsible for particular aspects or total design.  \n Project experience includes Commercial, Healthcare, Education (schools, colleges, universities)  Rail (station), \nAutomotive, Industries / Factories, Residential, Student accommodation and Public realm areas.  \n Deft in efficiently executing projects with close co -ordination with contractors, architects, design consultants \nand other external agencies; ensuring on time  deliverables . \n Excellent communication, leadership, interpersonal, relationship management, analytical and negotiation skills.  \n Conversant with RIBA stages, BIM Levels and BREEAM credentials.  \n Conversant with Health Technical Memorandums (HTMs) and Health Building Notes (HBNs).  \n \n \nORGANISATIONAL EXPERIENCE  \n \n \nAug 2018  – Present  Principal  Engineer  Arup,  UK \n \nManage MEP team, prepare work forecast/resource, assess design and set milestones, contribute to H&S, risk \nregisters, HAZID reports and CDM registers. Duties also involve checking deliverables including drawings, \nspecifications, reports and schedules.  \n \nKey Projects:  \n \n Automatic People Mover, UK – MEP lead for the design of Automatic People Mover between a new train station \nand airport. Project consists of design of 2.2 km viaduct, 4 no. stops and Maintenance Facility. (£150M \napproximate value).  \n HS2 Interchange Station – Senior Engineer for the HS2 station connecting London and Birmingham.  \n Walsall Manor Hosp ital – Senior Engineer for new 6000m2 extension of A&E department.  \n Colt Data Centre – Senior Engineer for new extension of existing site for additional IT capacity of 4.8MW.  \n Midland Metropolitan University Hospital – Compliance check engineer on the ne w 670 beds acute hospital with \n15 operating theatres.  \n Velindre Cancer Centre, Cardiff – Lead electrical engineer for the concept design of 35000m2 cancer hospital.  \n \nMar 2016 – Aug 2018  Principal  Electrical  Engineer  Building Services Design,  UK \n \nDuties involved securing new work, preparing fee proposals, manage electrical team of up to 6 engineers, resource \nplanning, interview new staff, mentoring juniors, reporting to director, project management, checking design & \ncompliance monitoring, performi ng QA check, attending client/design/contractor meetings, prepare meeting \nminutes, carrying out risk assessment, preparing electrical cost /quantity estimates, liaising with utility/local \nauthorities and manufacturers. Check and prepare deliverables includ ing calculations, drawings, specifications, \nreports and schedules.  \nDuties also involved site surveys followed by relevant defects reports, site progress reports, check program against \ninstallation work, represent client during witness testing and attend co mmissioning.  "}, {"page_num": 1, "text": " \n Key Projects:  \n \n University of Leicester, Leicester – Project Manager for fire alarm replacement of existing operational building.  \nThe building is approximately 15,000m2 in area and has some very significant labs.  \n Lillie Square Development, London – Detail design of new luxury high rise penthouses and apartments.  \n Regent’s Crescent, London – Detail design of 70+ luxury high rise apartments in Central London.  \n Greenwood Academy, Birmingham – Developed detail desi gn of 9500m2 academy including various workshops \nand labs for secondary students.  \n Kaplan International College, Liverpool – Detail design of three storey college building and nine storey student \naccommodation with a total area of about 10,000m2. \n Jaguar  Land Rover Showrooms – Developed detail design of two new showrooms including workshops in and \naround London estimated at approximately £15M each.  \n \n \nNov 2013 – Mar 2016  Senior Building Services  Engineer  (Electrical)  Pick Everard, UK  \n \nDuties involved carry ing projects from inception to completion – prepare electrical drawings, design calculations, \nreports and specifications. Duties also involved attending various meetings, preparing fee proposals, contributing to \nMEP BIM strategy, assigning tasks to graduat e/intermediate engineers and CAD team, coordinating MEP services, \nperforming QA check, organising CPD seminars, site surveys followed by relevant reports, raising/responding to \nRFIs, take project brief from client or team Director, communicating with utili ty authorities and manufacturers.  \n \nResponsibilities also required site surveys, checking installation, produce snagging reports, produce design risk \nassessments and attend testing/commissioning of electrical systems.  \n \nKey Projects:  \n \n Warwickshire and London Borough of Hounslow Schools – Detail and Stage 3 design for new/extension of \nvarious schools including provision of SEN facilities ranging from £800K to £30M.  \n Royal Mail Projects – Detail design of new delivery mail centres at Por tsmouth and Harrow.  \n National Grid Projects – Detail design for refurbishment of office areas in various buildings located at different \nsites ranging from £600K to £5M.  \n Cat B Fit Out – Detail design of Cat B fit out of four levels plus basement and roof  in a high spec office building \nin Bristol for EDFE. Floors generally comprised open plan offices, individual offices, meeting rooms, kitchen, \nrestaurant, training suite and level 2 classed IT  rooms.  \n \n \nJul 2012 – Oct 2013  Senior  Engineer  Grontmij,  UK \n \nProject Engineer for various projects. Duties involved designing electrical services, assigning tasks to graduate \nengineers and CAD team, reporting to team director, attending various meetings, preparing technical reports, \ncoordinating MEP services, compliance  monitoring, liaising with various manufacturers and contractors.  \nRepresented client side during witness testing & commissioning, produced risk assessments and snagging reports. \nKey Projects:  \n Bloomberg Place, London – Detail design of £750M two nine storey office buildings (approx. 100,000m2) with  \nFoster + Partners, three levels of basement and ground floor for retail.  \n Kings Cross: Public Realm, London – Stage 3 design for the 5500m2 public realm area between various office \nbuildings at Kings Cross which includes feature fountains, event spaces and kiosks.  \n Project Flow, London – Detail design of base build and Cat A fit -out for two new separate office buildings with \na combined area of approx. 6500m2. \n Kings Cross Public Realm, London – Project Eng ineer for preparing Employment Requirements including \nScope of Works and Concept Design of Public Realm (5500m2) for the  Client.  "}, {"page_num": 2, "text": " \n Jul 2008 – Jul 2012  Intermediate Electrical  Design  Engineer  Hulley and Kirkwood Ltd,  UK \n \nLead electrical design on small/medium scale projects provided support on large scale projects. Duties involved \ndesigning all electrical installations, attending design/site meetings, undertaking design audits, filling in QA forms, \nreplying to RFIs, reporting t o director, surveying sites, communicating with utility authorities and manufacturers.  \n \n \nKey Projects:  \n \n New Hospitals, Scotland – Assisted design of lighting and fire alarms in Fife Acute hospital and Edinburgh’s \nSick Children hospital. Estimated cost of each hospital at about £150M.  \n Borders General Hospital, Scotland – Detail design for the extension of Stoke and Palliative Care units in the \nexisting hospital at the borders.  \n New Council Offices, Bathgate – Detail design for the new c ouncil offices (approx. 2500m2) with BDP \narchitects. The building achieved various awards.  \n Dalkeith Health Centre, Edinburgh – Detail design for the new health centre comprising consulting rooms and \nphysiotherapy treatment/gym area in Edinburgh. The buil ding achieved B+ EPC rating.  \n Migdale Community Centre, Inverness – Detail design for the 24 beds community hospital in Bonar Bridge, \nInverness.  \n \n \nOct 2006 – Jul 2008  Graduate  Electrical Engineer  RMJM Scotland Limited,  UK \n \nProvided support on various proj ects including preparing drawings at tender and construction stage. Duties \ninvolved attending design meetings, reporting to team associate, site visits, liaising with various  manufacturers.  \n \nKey Projects:  \n \n North Glasgow College, Glasgow – Detail design f or the 16900m2 college: home to a state of art learning, \nresource centre, conference facilities and fully equipped sports hall.  \n City Palace, Moscow – Concept design for the 46 storey tower which includes offices, retails, leisure facilities \nand public fu nction areas.  \n \n \nJun 2004 – Aug 2005  Trainee  Electrical Engineer  Sampath Constructions,  India  \n \nProvided support on various housing projects. Duties involved producing drawings, estimating electrical quantities, \nsite surveys, attending meetings and reporting to senior engineers.  \n \nDesign of electrical installations includes and not limited to – containment, small power, lighting, emergency \nlighting, fire alarms systems, security, access control, data installation, nurse call system, generator, UPS and  \nlightning protection in a  building.  \n \nPreparing specifications includes – technical and performance specification.  \n \nProject Manager responsible for managing projects including cost, resources, risk registers, H&S files, \nassumption registers, snagging reports, site progress reports, testing & commissioning, meeting minutes etc.  \n \n \nACADEMIC CREDENTIALS  \n \n \nM.Sc. Building Services Engineering Management - Heriot Watt University, Edinburgh, UK \nPassed – First Class  2005 -2006  \nB.E. Electrical and Electronics Engineering – Osmania University, Hyderabad, India \nPassed – First Class  2000 -2004  "}, {"page_num": 3, "text": " \n PROFICIENCY FORTE  \n \n \nTechnical Knowledge:  \n \n Revit – Prepare coordinated 3D drawings  \n BIM 360  \n AutoCAD – Prepare electrical drawings  \n Microstation – Prepare electrical drawings  \n Naviswork  \n Bluebeam  \n Space allowance  \n Amtech Pro -design and Protect – Calculate cable sizes and prepare distribution board schedules  \n Hevacomp – Calculate cable sizes and prepare distribution board schedules  \n Dialux – Design lighting solutions to CIBSE standards and Emergency lighting to BS5266  \n Fire Detection systems – Design to comply with BS5839  \n Lightning and Protection – Design to comply with BSEN 62305  \n Generator and UPS design  \n HV Design  \n Familiar with other international standards like NFPA  \n \nACHIEVEMENTS AND SKILLS  \n \n \n Member of CIBSE (Member Grade)  \n Hold a valid Construction Site Visitor card  \n Knowledge of CDM / Health & Safety Regulations and Principal Designe r role  \n Attended Asbestos and Site awareness training sessions  \n Hold full UK driving license  \n Active member of CPD courses  \n Represented the department of Electrical Engineering at Osmania University meeting in the year 2004.  \n Team working ability gained through education, employment and leisure activities. I am involved in extensive \nteamwork with professionals like contractors, architects, engineers and technicians etc.  \n Good planning, organizing, coordinating and scheduling skills enable me to meet deadlines and targets.  \n Developed high standards of written and verbal communication skills through class discussions, course works, \nreports, presentations and meetings.  \n Computer literate in MS office suites and Office 365  \n Can speak English , Urdu and Hindi fluently  \n Can speak and understand Arabic at a very basic level  \n \nINTERESTS  \n \n \nI enjoy most of the sports; particularly football and cricket. Surfing internet and reading Building Journals are other \nhobbies of mine.  \n \n \nREFERENCES  \n \n \nProvided on request  \n "}]